# Написать серию вложенных циклов , которые выводят 10 строк символов #
# В каждой строке должно быть 15 символов #.

for x in range (10):
    for y in range(15):
        print('#',end='')
    print()