# Написать цикл for, который выводит приведенный ниже ряд чисел:
# 0 , 10 , 20 , 30 , 40 , 50 ,..., 1000


for x in range(0,1010,10):
    print(x)














